STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/Thread/Thread_Coap_Generic_ThreadX/STM32_WPAN/App/app_thread.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * File Name          : App/app_thread.c
 * Description        : Thread Application.
 ******************************************************************************
  * @attention
  *
  * Copyright (c) 2019-2021 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENQ file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "app_common.h"
#include "utilities_common.h"
#include "app_entry.h"
#include "dbg_trace.h"
#include "app_thread.h"
#include "stm32wbxx_core_interface_def.h"
#include "openthread_api_wb.h"
#include "shci.h"
#include "stm_logging.h"
#include "app_conf.h"
#include "stm32_lpm.h"
#include "tx_api.h"
#if (CFG_USB_INTERFACE_ENABLE != 0)
#include "vcp.h"
#include "vcp_conf.h"
#endif /* (CFG_USB_INTERFACE_ENABLE != 0) */

/* Private includes -----------------------------------------------------------*/


/* Private defines -----------------------------------------------------------*/
#define C_SIZE_CMD_STRING       256U
#define C_PANID                 0x1111U
#define C_CHANNEL_NB            17U

/* USER CODE BEGIN PD */
#define C_RESSOURCE             "light"
#define COAP_PAYLOAD_LENGTH 2
#define WAIT_TIMEOUT                     (5*1000*1000/CFG_TS_TICK_VAL) /**< 5s */
#define PB_REBOUND_DELAY        250

#ifdef TX_ENABLE_EVENT_TRACE
#define APP_MAX_THREAD			8u
#define DEBUG_TRACEX_SIZE		(64u * 512u )
#define APP_TRACE_INFO          (TX_TRACE_USER_EVENT_START + 1)
#endif // TX_ENABLE_EVENT_TRACE
/* USER CODE END PD */



/* Private macros ------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private function prototypes -----------------------------------------------*/
static void APP_THREAD_CheckWirelessFirmwareInfo(void);
static void APP_THREAD_DeviceConfig(void);
static void APP_THREAD_StateNotif(uint32_t NotifFlags, void *pContext);
static void APP_THREAD_TraceError(const char * pMess, uint32_t ErrCode);
#if (CFG_FULL_LOW_POWER == 0)
static void Send_CLI_To_M0_Task(ULONG argument);
static void Send_CLI_To_M0(void);
#endif /* (CFG_FULL_LOW_POWER == 0) */
static void Send_CLI_Ack_For_OT(void);
static void HostTxCb( void );
static void Wait_Getting_Ack_From_M0(void);
static void Receive_Ack_From_M0(void);
static void Receive_Notification_From_M0(void);
static void APP_THREAD_ProcessCoapNotConfirmable(ULONG argument);
static void APP_THREAD_ProcessCoapConfirmable(ULONG argument);
static void APP_THREAD_ProcessCoapNotConfirmable(ULONG argument);

#if (CFG_HW_LPUART1_ENABLED == 1)
extern void MX_LPUART1_UART_Init(void);
#endif
#if (CFG_HW_USART1_ENABLED == 1)
extern void MX_USART1_UART_Init(void);
#endif
#if (CFG_USB_INTERFACE_ENABLE != 0)
static uint32_t ProcessCmdString(uint8_t* buf , uint32_t len);
#else
#if (CFG_FULL_LOW_POWER == 0)
static void RxCpltCallback(void);
#endif /* (CFG_FULL_LOW_POWER == 0) */
#endif /* (CFG_USB_INTERFACE_ENABLE != 0) */

/* USER CODE BEGIN PFP */
static void APP_THREAD_CoapSendRequest( otCoapResource          * aCoapRessource,
                                        otCoapType              aCoapType,
                                        otCoapCode              aCoapCode,
                                        const char              * aStringAddress,
                                        const otIp6Address      * aPeerAddress,
                                        uint8_t                 * aPayload,
                                        uint16_t                Size,
                                        otCoapResponseHandler   aHandler,
                                        void                    * aContext);

static void APP_THREAD_CoapRequestHandler(void                * pContext,
                                          otMessage           * pMessage,
                                          const otMessageInfo * pMessageInfo);

static void APP_THREAD_CoapSendDataResponse(otMessage * pMessage, const otMessageInfo * pMessageInfo);

static void APP_THREAD_CoapDataRespHandler( void                * aContext,
                                            otMessage           * pMessage,
                                            const otMessageInfo * pMessageInfo,
                                            otError             result);

static void APP_THREAD_InitPayloadWrite(void);
static void APP_THREAD_SendCoapNonConf(void);
static void APP_THREAD_SendCoapConf(void);
static void APP_THREAD_TimingElapsed(void);
static bool APP_THREAD_CheckMsgValidity(void);
/* USER CODE END PFP */

/* Private variables -----------------------------------------------*/
#if (CFG_USB_INTERFACE_ENABLE != 0)
static uint8_t TmpString[C_SIZE_CMD_STRING];
static uint8_t VcpRxBuffer[sizeof(TL_CmdSerial_t)];        /* Received Data over USB are stored in this buffer */
static uint8_t VcpTxBuffer[sizeof(TL_EvtPacket_t) + 254U]; /* Transmit buffer over USB */
#else
#if (CFG_FULL_LOW_POWER == 0)
static uint8_t aRxBuffer[C_SIZE_CMD_STRING];
#endif /* (CFG_FULL_LOW_POWER == 0) */
#endif /* (CFG_USB_INTERFACE_ENABLE != 0) */

#if (CFG_FULL_LOW_POWER == 0)
static uint8_t CommandString[C_SIZE_CMD_STRING];
#endif /* (CFG_FULL_LOW_POWER == 0) */
static __IO uint16_t indexReceiveChar = 0;
static __IO uint16_t CptReceiveCmdFromUser = 0;

static TL_CmdPacket_t *p_thread_otcmdbuffer;
static TL_EvtPacket_t *p_thread_notif_M0_to_M4;
static __IO uint32_t  CptReceiveMsgFromM0 = 0;

TX_THREAD OsTaskMessageM0ToM4Id;
TX_THREAD OsTaskRequestM0ToM4Id;
TX_THREAD OsTaskNwkFormId;
TX_THREAD OsTaskSendCliToM0;
TX_THREAD OsTaskCoapNotConfirmable;
TX_THREAD OsTaskCoapConfirmable;
TX_MUTEX MtxThreadId;

TX_SEMAPHORE TransferToM0Semaphore;
TX_SEMAPHORE StartupEndSemaphore;

TX_SEMAPHORE NWKFormSemaphore; 
TX_SEMAPHORE MessageM0ToM4Semaphore;
TX_SEMAPHORE RequestM0ToM4Semaphore;
TX_SEMAPHORE CoapNonConfSemaphore;
TX_SEMAPHORE CoapConfSemaphore;
TX_SEMAPHORE SendCliCmdSemaphore;
TX_SEMAPHORE TimerSemaphore;


