STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/Thread/Thread_Coap_Generic_ThreadX/STM32_WPAN/App/app_thread.c
PLACE_IN_SECTION("MB_MEM1") ALIGN(4) static TL_TH_Config_t ThreadConfigBuffer;
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static TL_CmdPacket_t ThreadOtCmdBuffer;
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t ThreadNotifRspEvtBuffer[sizeof(TL_PacketHeader_t) + TL_EVT_HDR_SIZE + 255U];
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static TL_CmdPacket_t ThreadCliCmdBuffer;
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static TL_CmdPacket_t ThreadCliNotBuffer;
extern uint8_t g_ot_notification_allowed;

/* USER CODE BEGIN PV */
static otCoapResource OT_Ressource = {C_RESSOURCE, APP_THREAD_CoapRequestHandler,"MyOwnContext", NULL};
static otMessageInfo OT_MessageInfo = {0};
static otMessage* pOT_Message = NULL;
static otMessage* pOT_MessageResponse = NULL;

static uint8_t PayloadWrite[COAP_PAYLOAD_LENGTH]= {0};
static uint8_t PayloadRead[COAP_PAYLOAD_LENGTH]= {0};
static uint8_t TimerID;

#ifdef TX_ENABLE_EVENT_TRACE
static UCHAR	cDebugTraceX[DEBUG_TRACEX_SIZE];
#endif // TX_ENABMLE_EVENT_TRACE

#ifdef TX_LOW_POWER
typedef struct
{
  uint32_t LpTXTimeLeftOnEntry;
  uint8_t LpTXTimerThreadx_Id;
} LpTXTimerContext_t;

static LpTXTimerContext_t LpTXTimerContext;
#endif // TX_LOW_POWER

/* USER CODE END PV */


/* Functions Definition ------------------------------------------------------*/




/**
  * @brief  Thread initialization.
  * @param  p_byte_pool : Memory pool
  * @retval None
  */

void APP_THREAD_Init(TX_BYTE_POOL* p_byte_pool)
{
  UINT ThreadXStatus = TX_THREAD_ERROR;
  SHCI_CmdStatus_t ThreadInitStatus;
  CHAR* pointer = TX_NULL;

  /* Check the compatibility with the Coprocessor Wireless Firmware loaded */
  APP_THREAD_CheckWirelessFirmwareInfo();

#if (CFG_USB_INTERFACE_ENABLE != 0)
  VCP_Init(&VcpTxBuffer[0], &VcpRxBuffer[0]);
#endif /* (CFG_USB_INTERFACE_ENABLE != 0) */

#ifdef TX_ENABLE_EVENT_TRACE
  // -- Enable ThreadX Trace --
  tx_trace_enable( cDebugTraceX, sizeof(cDebugTraceX), APP_MAX_THREAD );
#endif // TX_ENABLE_EVENT_TRACE
    
  /* Register cmdbuffer */
  APP_THREAD_RegisterCmdBuffer(&ThreadOtCmdBuffer);

  /**
   * Do not allow standby in the application
   */
  UTIL_LPM_SetOffMode(1 << CFG_LPM_APP_THREAD, UTIL_LPM_DISABLE);

  /* Init config buffer and call TL_THREAD_Init */
  APP_THREAD_TL_THREAD_INIT();

  /* Initialize the mutex */
  tx_mutex_create(&MtxThreadId, "MtxThreadId", TX_NO_INHERIT);

  /* Initialize the semaphores */
  tx_semaphore_create(&StartupEndSemaphore, "StartupEndSemaphore", 0);
  tx_semaphore_create(&TransferToM0Semaphore, "TransferToM0Semaphore", 0);
  tx_semaphore_create(&MessageM0ToM4Semaphore, "MessageM0ToM4Semaphore", 0);
  tx_semaphore_create(&CoapNonConfSemaphore, "CoapNonConfSemaphore", 0);
  tx_semaphore_create(&CoapConfSemaphore, "CoapConfSemaphore", 0);
  tx_semaphore_create(&TimerSemaphore, "TimerSemaphore", 0);

  /* Create the Timer service */
  HW_TS_Create(CFG_TIM_PROC_ID_ISR, &TimerID, hw_ts_SingleShot, APP_THREAD_TimingElapsed);

  /* Create the different tasks */
  /* Task to manage the messages from the M0 to the M4 */
  tx_byte_allocate(p_byte_pool, (VOID**) &pointer, DEMO_STACK_SIZE_LARGE, TX_NO_WAIT);
  ThreadXStatus = tx_thread_create(&OsTaskMessageM0ToM4Id,
                                   "OsTaskMessageM0ToM4Id",
                                   APP_THREAD_ProcessMsgM0ToM4,
                                   0,
                                   pointer,
                                   DEMO_STACK_SIZE_LARGE,
                                   16,
                                   16,
                                   TX_NO_TIME_SLICE,
                                   TX_AUTO_START);
  if (ThreadXStatus != TX_SUCCESS)
    { APP_THREAD_Error(ERR_THREAD_THREAD_X_FAILED,1); }

  
  /* Task to manage the task used to send a COAP confirmable request */
  tx_byte_allocate(p_byte_pool, (VOID**) &pointer, DEMO_STACK_SIZE_LARGE, TX_NO_WAIT);
  ThreadXStatus = tx_thread_create(&OsTaskCoapConfirmable,
                                    "OsTaskCoapConfirmable",
                                    APP_THREAD_ProcessCoapConfirmable,
                                    0,
                                    pointer,
                                    DEMO_STACK_SIZE_LARGE,
                                    16, //16
                                    16,  // 16
                                    TX_NO_TIME_SLICE,
                                    TX_AUTO_START);

  if (ThreadXStatus != TX_SUCCESS)
    { APP_THREAD_Error(ERR_THREAD_THREAD_X_FAILED,2); }

  
  /* Task to manage the task used to send a COAP non- confirmable request */
  tx_byte_allocate(p_byte_pool, (VOID**) &pointer, DEMO_STACK_SIZE_LARGE, TX_NO_WAIT);
  ThreadXStatus = tx_thread_create(&OsTaskCoapNotConfirmable,
                                    "OsTaskCoapNotConfirmable",
                                    APP_THREAD_ProcessCoapNotConfirmable,
                                    0,
                                    pointer,
                                    DEMO_STACK_SIZE_LARGE,
                                    16,
                                    16,
                                    TX_NO_TIME_SLICE,
                                    TX_AUTO_START);
  
  if ( ThreadXStatus != TX_SUCCESS )
    { APP_THREAD_Error(ERR_THREAD_THREAD_X_FAILED,1); }


  /* Configure UART for sending CLI command from M4 */
  APP_THREAD_Init_UART_CLI(p_byte_pool);

  /* Send Thread start system cmd to M0 */
  ThreadInitStatus = SHCI_C2_THREAD_Init();

  /* Prevent unused argument(s) compilation warning */
  UNUSED(ThreadInitStatus);

  /* Initialize and configure the Thread device*/
  APP_THREAD_DeviceConfig();
  
  APP_THREAD_InitPayloadWrite();
}

/**
  * @brief  Trace the error or the warning reported.
  * @param  ErrId :
  * @param  ErrCode
  * @retval None
  */
void APP_THREAD_Error(uint32_t ErrId, uint32_t ErrCode)
{
  /* USER CODE BEGIN APP_THREAD_Error_1 */

  /* USER CODE END APP_THREAD_Error_1 */
  switch(ErrId)
  {
  case ERR_REC_MULTI_MSG_FROM_M0 :
    APP_THREAD_TraceError("ERROR : ERR_REC_MULTI_MSG_FROM_M0 ", ErrCode);
    break;
  case ERR_THREAD_SET_STATE_CB :
    APP_THREAD_TraceError("ERROR : ERR_THREAD_SET_STATE_CB ",ErrCode);
    break;
  case ERR_THREAD_SET_CHANNEL :
    APP_THREAD_TraceError("ERROR : ERR_THREAD_SET_CHANNEL ",ErrCode);
    break;
  case ERR_THREAD_SET_PANID :
    APP_THREAD_TraceError("ERROR : ERR_THREAD_SET_PANID ",ErrCode);
    break;
  case ERR_THREAD_IPV6_ENABLE :
    APP_THREAD_TraceError("ERROR : ERR_THREAD_IPV6_ENABLE ",ErrCode);
    break;
  case ERR_THREAD_START :
    APP_THREAD_TraceError("ERROR: ERR_THREAD_START ", ErrCode);
    break;
  case ERR_THREAD_ERASE_PERSISTENT_INFO :
    APP_THREAD_TraceError("ERROR : ERR_THREAD_ERASE_PERSISTENT_INFO ",ErrCode);
    break;
  case ERR_THREAD_SET_NETWORK_KEY :
    APP_THREAD_TraceError("ERROR : ERR_THREAD_SET_NETWORK_KEY ",ErrCode);
    break;
  case ERR_THREAD_CHECK_WIRELESS :
    APP_THREAD_TraceError("ERROR : ERR_THREAD_CHECK_WIRELESS ",ErrCode);
    break;
  /* USER CODE BEGIN APP_THREAD_Error_2 */
  case ERR_THREAD_COAP_START :
    APP_THREAD_TraceError("ERROR : ERR_THREAD_COAP_START ",ErrCode);
    break;
  case ERR_THREAD_COAP_ADD_RESSOURCE :
    APP_THREAD_TraceError("ERROR : ERR_THREAD_COAP_ADD_RESSOURCE ",ErrCode);
    break;
  case ERR_THREAD_MESSAGE_READ :
    APP_THREAD_TraceError("ERROR : ERR_THREAD_MESSAGE_READ ",ErrCode);
    break;
  case ERR_THREAD_COAP_SEND_RESPONSE :
    APP_THREAD_TraceError("ERROR : ERR_THREAD_COAP_SEND_RESPONSE ",ErrCode);
    break;
  case ERR_THREAD_COAP_APPEND :
    APP_THREAD_TraceError("ERROR : ERR_THREAD_COAP_APPEND ",ErrCode);
    break;
  case ERR_THREAD_COAP_SEND_REQUEST :
    APP_THREAD_TraceError("ERROR : ERR_THREAD_COAP_SEND_REQUEST ",ErrCode);
    break;
  case ERR_THREAD_MSG_COMPARE_FAILED:
    APP_THREAD_TraceError("ERROR : ERR_THREAD_MSG_COMPARE_FAILED ",ErrCode);
    break;
  case ERR_THREAD_THREAD_X_FAILED:
    APP_THREAD_TraceError("ERROR : ERR_THREAD_THREAD_X_FAILED ",ErrCode);
    break;
  /* USER CODE END APP_THREAD_Error_2 */
  default :
    APP_THREAD_TraceError("ERROR Unknown ", 0);
    break;
  }
}

